{"pageProps":{"contents":"<h1 id=\"preface\"><a href=\"#preface\">Preface</a></h1>\n\n<p>I&#39;ve been asked pretty often about what courses to take at UNSW, and guides on how to do well so hopefully this page will help.</p>\n<p>Before UNSW, I had an interest in engineering (leaning towards Electrical Engineering), though I also wanted to do a double degree with Commerce since I found economics interesting.\nSo I picked a double degree in Computer Science / Commerce as the degree was 4 years rather than the 5.6 years of Engineering / Commerce, despite having 0 programming experience (though I dropped Commerce after taking 1 Commerce course).</p>\n<h1 id=\"20t1\"><a href=\"#20t1\">20T1</a></h1>\n\n<h2 id=\"comp1511---programming-fundamentals\">COMP1511 - Programming Fundamentals</h2>\n<p><em>C, if … else, while, arrays, pointers, structs, linked lists</em></p>\n<h3 id=\"overview\">Overview</h3>\n<p>The starter programming course.\nYou’ll have 2 lectures, 1 tut-lab each week (where you have a 1 hr tutorial where you listen to your tutor present topics, and 2 hr lab where you code and can ask for help).\nThe course tends to get a bit more confusing when pointers are introduced.\nWhilst the skills taught in this course (i.e. if else, and while loops) are easily transferable to other languages, you are mostly taught “programming” which is a tool, but not necessarily the “science” of computer science (more theory), or the “engineering” of software engineering (how to write good quality, useful code that can adapt to new requirements).</p>\n<h4 id=\"do-i-need-to-know-programming-beforehand\">Do I need to know programming beforehand?</h4>\n<p>I had next to 0 programming coming into the course, and the course is designed such that someone with no experience can learn everything so, it’s very possible to HD the course without prior experience.</p>\n<h4 id=\"why-do-we-learn-c\">Why do we learn C?</h4>\n<p>Admittedly, C is not the most practical language (you can easily build an app or website using it), despite this, in my opinion there’s good reason to learn it first.</p>\n<ul>\n<li>It’s a low level language (compared to most others you will use), meaning you interact more with the underlying machine - so you learn a bit about computer memory</li>\n<li>Other beginner friendly languages (i.e. Python/JavaScript) has many abstractions/inbuilt functions, whereas in C you have to code it yourself, which forces you to think about how things work.</li>\n</ul>\n<h4 id=\"what-if-ive-done-programming-before\">What if I&#39;ve done programming before?</h4>\n<p>There are many fantastic challenge problems in the course - give a shot at those.\nThe final exam, and to a small degree the assignments have an exponential difficulty, so even those with experience may struggle with some of the problems.\nI thoroughly enjoyed the challenges, and found them to motivate me to study CS more, though it may not be everyone’s cup of tea, or that practical/useful.</p>\n<h2 id=\"math1131---mathematics-1a\">MATH1131 - Mathematics 1A</h2>\n<p><em>Linear algebra (complex numbers, vectors, linear equations, matrices), calculus (limits, continuity, integration, logarithms, exponentials, hyperbolic functions)</em></p>\n<h3 id=\"overview-1\">Overview</h3>\n<p>Goes over linear algebra and calculus.\nIn my opinion, the calculus part started of pretty dry as it was focused a lot on the definition of a limit, etc. I originally was doing 1141, but dropped it after a couple of weeks due to terrible time management and me adapting from high school to uni + work.\nIt&#39;s pretty normal to get close to full marks for your pre exam mark and lost most your marks in the final exam.</p>\n<h4 id=\"will-i-struggle-in-this-course-if-i-havent-done-3u-or-4u\">Will I struggle in this course if I haven&#39;t done 3U or 4U?</h4>\n<p>You&#39;ll have to put in more effort, but it&#39;s 100% not impossible to do very well.\nIt&#39;s not unheard of for students to not do 4U, but do well in 1131, and then even pick up 1241.</p>\n<h4 id=\"should-i-do-this-or-math1241\">Should I do this or MATH1241?</h4>\n<p>From what I know MATH1241 requires you to do / submit assignments earlier, and go more into mathematical proofs.\nHowever, for most people doing CS, I&#39;d argue the extra content in 1241 will not be relevant.\nSo if you want to do more math, feel free to do 1241.</p>\n<h4 id=\"recommended-resources\">Recommended resources</h4>\n<ul>\n<li>Get the online textbook for the course from moodle (I found this more useful than the lectures)</li>\n</ul>\n<h2 id=\"econ1101---microeconomics-1\">ECON1101 - Microeconomics 1</h2>\n<p><em>Microeconomics idk man</em></p>\n<h3 id=\"overview-2\">Overview</h3>\n<p>Quite a fun course, where you&#39;re required to complete a mid sem, play a game called Playconomics and a final exam.\nAlberto&#39;s lecturers were great fun, and the first lecture was a bit like a comedy night live (until covid hit and things were online).</p>\n<p>Overall, the course is a good introduction to Economics (though nothing you can&#39;t learn from casually watching Youtube videos).\nHowever, we had to pay $40 for the textbook + Playconomics.\nI decided to drop commerce after this course since I didn&#39;t find the course as engaging and writing long answer responses / essays wasn&#39;t my thing.</p>\n<h4 id=\"is-this-course-a-wam-booster\">Is this course a WAM booster?</h4>\n<p>To be fair it was pretty easy when I did it.\nThey created a giant database of questions, some of which would be in the final exam, so that students could revise the content.\nHowever, in my exam, there was a lot of vague game theory questions (likely because the exam was online, so students had access to their answers they made before the exam) which were tricky.</p>\n<h4 id=\"what-is-playconomics\">What is Playconomics?</h4>\n<p>In the lectures, they mention a revolutionary award winning game, where students who played it got better marks. In reality, it was because the game tended to broken, and a free 20 marks.\nAccording to Alberto, every time, some engineering students manage to find an exploit and form a engineering cartel, resulting in some oligarchy of the economy, disrupting the economies of other players.</p>\n<h4 id=\"recommended-resources-1\">Recommended resources</h4>\n<ul>\n<li>Read the textbook that they give you</li>\n</ul>\n<h1 id=\"20t2\"><a href=\"#20t2\">20T2</a></h1>\n\n<h2 id=\"comp1521---computer-system-fundamentals\">COMP1521 - Computer System Fundamentals</h2>\n<p><em>Bits &amp; bytes, MIPs (assembly language), file systems, concurrency, virtual memory</em></p>\n<h3 id=\"overview-3\">Overview</h3>\n<p>A course where you learn about low level bits &amp; bytes, the MIPs assembly language, and file systems. This was my least favourite 1st year course, as the content was pretty dry.</p>\n<p>Overall, the content from this course wasn&#39;t too immediately useful unless you intend to go more into low level content, i.e. embedded systems / operating systems, so you can hold this course off (which tends to be alright for dual degrees).</p>\n<p>You&#39;ll find the content in this course is a bit of a jump from COMP1511 - the content after file systems was introduced was all a bit of a blur and quite high level.\nThough if you are interested in those topics, take Operating Systems.</p>\n<h4 id=\"is-this-more-difficult-than-comp2521\">Is this more difficult than COMP2521?</h4>\n<p>I&#39;d say this course is around the same level of difficulty of COMP2521.\nYou may find that this course is more &quot;content&quot; heavy, whilst 2521 is more &quot;theory&quot; heavy.\nThe 1521 challenges are quite tougher than that of 1511, and if Andrew Taylor is in charge, the later questions of the exam will be exponentially harder than the earlier ones.</p>\n<h4 id=\"should-i-take-this-course-or-comp2521-first\">Should I take this course or COMP2521 first?</h4>\n<p>Most computer science students probably take both courses in T2 simultaneously, though if you had to choose, take 2521 first as it is a prerequisite to many comp courses.</p>\n<h2 id=\"comp2521---data-structures-and-algorithms\">COMP2521 - Data Structures and Algorithms</h2>\n<p><em>Big O, BST (Binary Search Trees), balanced BSTs, graphs &amp; graph algos, hashing, heaps</em></p>\n<h3 id=\"overview-4\">Overview</h3>\n<p>My favourite 1st year comp course.\nThe course begins off with a recap on linked lists, so you may benefit from just having done COMP1511 (though not necessarily).\nFrom there, it&#39;s a mix of implementing data structures &amp; algorithms in C and some theory (though nothing too complex / much math involved).</p>\n<h4 id=\"why-is-the-content-in-this-course-important\">Why is the content in this course important?</h4>\n<p>Whilst the content wouldn&#39;t help you build a cool practical application anytime soon, there are two reasons I suggest completing this course.</p>\n<ol>\n<li>You learn how to quantitatively assess code quality (i.e. how efficient is your code)</li>\n<li>The content here is relevant for most software engineering technical interviews</li>\n<li>Some of the algorithms, i.e. BFS, DFS can still be useful in software engineering</li>\n</ol>\n<p>Aside from that, you&#39;ll be more than fine without having to remember the quirks of a red-black tree or 2-3-4 trees.</p>\n<h4 id=\"recommended-resources-2\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA\">Back To Back SWE</a></li>\n</ul>\n<h2 id=\"math1231---mathematics-1b\">MATH1231 - Mathematics 1B</h2>\n<p><em>Linear algebra (vector spaces, matrices, linear transformation, eigenvalues &amp; eigenvectors), calculus(differential equations, sequences, series, integration)</em></p>\n<h3 id=\"overview-5\">Overview</h3>\n<p>More on Linear Algebra and Calculus.\nI found the matrices content to be quite interesting (which has some applications here and there in computer science).\nMeanwhile the calculus gets more interesting compared to 11[34]1.</p>\n<h4 id=\"recommended-resources-3\">Recommended resources</h4>\n<ul>\n<li>Get the online textbook for the course from moodle (I found this more useful than the lectures)</li>\n</ul>\n<h1 id=\"20t3\"><a href=\"#20t3\">20T3</a></h1>\n\n<h2 id=\"comp1531---software-engineering-fundamentals\">COMP1531 - Software Engineering Fundamentals</h2>\n<p><em>Python, Git, Flask, HTTP, testing, agile</em></p>\n<h3 id=\"overview-6\">Overview</h3>\n<p>A useful group work course where you learn Python, Flask, and Git - also usually the first course you make something more interesting than a command line app.</p>\n<p>Most people will be able to pick up Python in the first few weeks, and the course for most students is mostly focused on the project.\nThe course tries to cover many different topics (i.e. Object Orientated Programming, software engineering practices like agile, testing, networks) briefly so make sure to properly revise that for the exam, as those concepts are not well covered by the project.</p>\n<h4 id=\"should-i-find-good-teammates-before-i-start-this-course\">Should I find good teammates before I start this course?</h4>\n<p>When I did it it was 5 people per course, but the project is very doable with 4, and can be done by even less.\nAs a result, I wouldn&#39;t classify this as &quot;necessary to find a good teammate&quot; beforehand (unlike COMP2511).\nI had one friend going into the course, and found new friends through the project.</p>\n<h4 id=\"what-should-i-do-to-prepare-for-this-course\">What should I do to prepare for this course?</h4>\n<p>If you are keen to get ahead, there isn&#39;t much needed but here are some ideas.</p>\n<ul>\n<li>Set up your computer for local development! You can do 90% of the course work on your own computer (there isn&#39;t anything like autotests / give).<ul>\n<li>If you are on a unix based OS, you don&#39;t need to do much, else if you are on windows, I recommend setting up WSL.</li>\n<li>Whilst you are at it I would recommend learning how to use virtual environments. A good explanation of how / why you should use them can be found <a href=\"https://uoa-eresearch.github.io/eresearch-cookbook/recipe/2014/11/26/python-virtual-env/\">here</a>.</li>\n</ul>\n</li>\n<li>Learn features of python such as dictionaries, and how to write &quot;pythonic&quot; code (i.e. short code that takes advantage of python&#39;s features)</li>\n</ul>\n<h2 id=\"comp3311---database-systems\">COMP3311 - Database Systems</h2>\n<p><em>Database Schemas, SQL PlpgSQL, psycopg, normalisation, relational algebra, concurrency</em></p>\n<h3 id=\"overview-7\">Overview</h3>\n<p>In my opinion, the best first year comp elective if you&#39;re looking at backend development / data stuff, as it&#39;s not super content heavy, and still practical / engaging.\nYou&#39;ll work with PostgreSQL (a relational database), and it&#39;s Python module.</p>\n<p>Overall the course structure looks a bit like:</p>\n<ol>\n<li>Database diagrams &amp; relational schema</li>\n<li>SQL queries &amp; PL/pgSQL</li>\n<li>Working with SQL in Python</li>\n<li>Theory (i.e. relational algebra, concurrency, ACID)</li>\n</ol>\n<p>There were 3 assignments, and the last two were quite fun, and required a bit of thinking (and I&#39;ve heard that in 21T1, they required a bit of BFS / DFS). The assignments were as follows.</p>\n<ol>\n<li>Writing a database schema</li>\n<li>Writing queries to extract data from a database (using SQL &amp; PL/pgSQL)</li>\n<li>Using python and psycopg to perform queries and extract data from a database</li>\n</ol>\n<p>In order of importance for the topics, I&#39;d say 2 &gt; 3 &gt; 1 &gt; 4 (I low-key learnt the theory content in the middle of my online exam and I suspect most of the cohort was the same).</p>\n<h4 id=\"should-i-do-this-course-in-first-year\">Should I do this course in first year?</h4>\n<p>Yep! I would highly recommend this as an early course elective because it&#39;s simple but also useful.\nThe only prerequisite is COMP2521, and I found the content to be a good balance of practical &amp; theory (and it was pretty fun writing efficient queries).</p>\n<h2 id=\"math1081---discrete-mathematics\">MATH1081 - Discrete Mathematics</h2>\n<p><em>Set theory, number theory, logic, counting techniques, graph theory</em></p>\n<h3 id=\"overview-8\">Overview</h3>\n<p>Different to the typical math you&#39;re used to.</p>\n<h4 id=\"is-discrete-math-more-useful-for-computer-science\">Is discrete math more useful for computer science?</h4>\n<p>The proofs that you complete in this course will be relevant for proofs in courses such as COMP3[18]21.\nThe perms &amp; combs are somewhat relevant for certain algorithms that brute force permutations / combinations.\nAs for the graph theory, 2521 also goes over Dijkstra&#39;s but in more depth, doing either course first just helps you a bit in the other when it comes to graph theory.</p>\n<h1 id=\"21t1\"><a href=\"#21t1\">21T1</a></h1>\n\n<h2 id=\"comp3231---operating-systems\">COMP3231 - Operating Systems</h2>\n<p><em>Concurrency, file systems, virtual memory</em></p>\n<h3 id=\"overview-9\">Overview</h3>\n<p>An alright course in my opinion which covers the last couple topics of 1521, but in way more depth. There are 3 main assignments on different topics, the latter 2 of which are a bit heavier workload.</p>\n<ol>\n<li>Concurrency (Individual work)</li>\n<li>System calls / File systems (Pair work)</li>\n<li>Virtual memory (Pair work)</li>\n</ol>\n<p>Overall I found the first topic to be the most interesting and useful (learning about locks, semaphores, mutexes, CVs, etc), which was sad since they spent much more time on the following topics (which I didn&#39;t find useful).</p>\n<p>The assignments tend to be more figuring out what you have to do than coding.\nI ended up doing all assignments solo and found the workload to be alright.</p>\n<h4 id=\"recommended-resources-4\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=qcBIvnQt0Bw&list=PLiwt1iVUib9s2Uo5BeYmwkDFUh70fJPxX\">Virtual memory lectures</a></li>\n</ul>\n<h2 id=\"comp3821---extended-algorithms-and-programming-techniques\">COMP3821 - Extended Algorithms and Programming Techniques</h2>\n<p><em>Divide &amp; conquer, greedy, dynamic programming, max flow, linear programming, reductions</em></p>\n<h3 id=\"overview-10\">Overview</h3>\n<p>There are only lectures (no tuts / labs), and also 0 programming as everything is written in the form of pseudo code or an english description of an algorithm with some proofs.\nSpecifically I had 4 assignments (each containing 5 questions to solve), and 4 group assignments.\nIn T1, I still spent more time on this course than OS (maybe because I found this more interesting).\nYou&#39;ll need some math knowledge such as matrices, complex numbers, and some proof writing, but they should all be covered in the 1st year math courses.</p>\n<h4 id=\"should-i-take-this-or-the-non-extended-version\">Should I take this or the non extended version?</h4>\n<p>Being the advanced version of COMP3121, I would only really recommend this course if you are willing to self study algorithms a bit more, and keen on learning reductions in a more formal way.\nSome people may decide to take this course since it is in T1 (whereas COMP3121 is T2 &amp; T3) and may teach algorithms required for intern / grad technical interviews.\nFrom experience, this wasn&#39;t the case too much and the only time I &#39;applied&#39; knowledge in this course was with some trading companies&#39; technical interviews.\nIf I had to choose again I would still take COMP3821 &gt; COMP3121, despite losing marks in the reduction topics.</p>\n<h4 id=\"recommended-resources-5\">Recommended resources</h4>\n<ul>\n<li>Not a resource, but please go over all the tutorial problems before the assignments.</li>\n<li><a href=\"https://www.youtube.com/watch?v=HtSuA80QTyo&list=PLUl4u3cNGP61Oq3tWYp6V_F-5jb5L2iHb\">MIT lectures on algorithms</a></li>\n<li><a href=\"https://leetcode.com/problemset/all/\">Leetcode</a> (I found this to pretty useful for dynamic programming)</li>\n</ul>\n<h1 id=\"21t2\"><a href=\"#21t2\">21T2</a></h1>\n\n<h2 id=\"comp2511---object-orientated-design--programming\">COMP2511 - Object-Orientated Design &amp; Programming</h2>\n<p><em>Java, design patterns, code smells</em></p>\n<h3 id=\"overview-11\">Overview</h3>\n<p>A course that requires a LOT of coding.\nWhilst in 2521, you learn to analyse code from a quantitative standpoint (i.e. time/space complexity), 2511 teaches you how to write high quality code from a qualitative standpoint (i.e. how to write non-spaghetti modular code that can change to adapt to requirements easily).</p>\n<p>There is an (solo work) assignment and a group work project.\nThe assignment works as a good introduction to Java, whilst the project is quite a large project, which I feel is a necessary evil to teach the benefits of OOP, and software engineering practices.</p>\n<h4 id=\"when-should-i-do-this-course\">When should I do this course?</h4>\n<p>In my opinion, I recommend completing this course perhaps as early as possible.\nLearning Java and design principles is very valuable, for writing higher quality code, and internships that require Java/OOP.</p>\n<h4 id=\"should-i-find-good-teammates-before-i-start-this-course-1\">Should I find good teammates before I start this course?</h4>\n<p>When I did the course, there were 4 members per group, all of which had to be in the same tut-lab class.\nUnlike COMP1531, I would recommend finding teammates you can trust before you start the course due to the bigger project (which not only requires much more thinking about the design, but also coding().\nIt&#39;s still &quot;doable&quot; by 2 - 3 people, though highly draining, I had to spend 14+ hrs coding some days and had 2k+ lines of tests.</p>\n<h4 id=\"recommended-resources-6\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://refactoring.guru/\">Refactoring guru</a></li>\n</ul>\n<h2 id=\"comp3141---software-system-design-and-implementation\">COMP3141 - Software System Design and Implementation</h2>\n<p><em>Haskell, functional programming, induction, PBT, monads, type theory, curry-howard correspondence</em></p>\n<h3 id=\"overview-12\">Overview</h3>\n<p>Starts off by going through Haskell, which can be tricky and it&#39;s definitely not like your typical coding.\nThe course jumps a bit in difficulty in week 7 when you go over &quot;functors, applicatives, and monads&quot;, so I would recommend reading up on this topic in flex week.\nIt then goes a bit more into the application of types as static checking, before touching on more theory, i.e. Curry-Howard correspondence in week 10 (which I&#39;m told is similar to COMP3161).</p>\n<h4 id=\"is-this-a-software-engineering-course\">Is this a software engineering course?</h4>\n<p>You don&#39;t build a practical app or anything in this course, which you may expect from software engineering, so if you like building things this may not be as fun.\nSimilarly, whilst you have to think quite a bit for the assignments, the code of the is pretty trivia to implement in other languages and the difficulty comes down to the self imposed restriction of using Haskell, and stronger type checking (as a result, the assignment was a lot of trying different permutations of code until it compiled).\nThat being said, you go more into the theory of good code.</p>\n<h4 id=\"recommended-resources-7\">Recommended resources</h4>\n<ul>\n<li><a href=\"http://learnyouahaskell.com/\">Learn You a Haskell for Great Good!</a></li>\n</ul>\n<h2 id=\"comp3331---computer-networks-and-applications\">COMP3331 - Computer Networks and Applications</h2>\n<p><em>Network application layer, transport layer, network layer, link layer, wireless networks</em></p>\n<h3 id=\"overview-13\">Overview</h3>\n<p>This course heavily follows the textbook &quot;Computer Networking: A Top-down Approach&quot; for 10 week (for the most part).\nThis may be a personal bias, but the course does have a lot of dry content, and since the content is the same as the textbook, I only did this as it was as prerequisite for COMP9243 (Distributed Systems).\nThe content mostly requires ROTE learning, and the labs were pretty straightforward (though sometimes boring, they would consist of running commands in the terminal / reading wireshark data, and the later labs reminded me more of high school science lab reports).</p>\n<h4 id=\"how-is-the-assignment\">How is the assignment?</h4>\n<p>I&#39;ve heard historically the assignment was pretty easy, however for 21T2, it did require some thinking about data structures and multi-threading.\nYou can choose between C, Python, and Java to implement the assignment (I would recommend Python for the sake of getting it done easily / quickly, and also because there&#39;s more tutor support for the language if you ever do need to go to help sessions).</p>\n<h4 id=\"recommended-resources-8\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.ucg.ac.me/skladiste/blog_44233/objava_64433/fajlovi/Computer%20Networking%20_%20A%20Top%20Down%20Approach,%207th,%20converted.pdf\">Computer Networking: A Top-down Approach 7th Edition</a></li>\n</ul>\n<h1 id=\"21t3\"><a href=\"#21t3\">21T3</a></h1>\n\n<h2 id=\"comp4121---advanced-algorithms\">COMP4121 - Advanced Algorithms</h2>\n<p><em>Modern Algorithms, Statistics, Linear Algebra</em></p>\n<h3 id=\"overview-14\">Overview</h3>\n<p>Probably my favourite course so far for the following reasons</p>\n<ol>\n<li>You have to do a major project which is due at the end of term.\nThere&#39;s no real constraints aside from the fact that it has to include some algorithm somewhere, and you have to have learnt something from it.</li>\n<li>This course definitely goes over more practical algorithms and very interesting algorithms.\nA lot of the previous algorithms you may have learnt are more &quot;discrete / combinatorial&quot;.\nHowever with the rise of data science / ML, a lot of algorithms are now also more &quot;numerical&quot; and rely on stats &amp; linear algebra which is what this course goes through.</li>\n</ol>\n<p>The course is 50% a major project and 50% a final exam.\nFor the major project, you can write an essay, implement and compare some algorithms, or discuss with Aleks what you want to do (mine is viewable <a href=\"https://github.com/angary/simulated-annealing-tsp\">here</a>).\nIt&#39;s probably also very valuable to go to the consultations and discuss what you would like to do.</p>\n<p>Overall, I highly recommend this to anyone interested in algorithms.\nThe only only &quot;downside&quot; is that the content is viewable from the course website even if you don&#39;t do the course, and there isn&#39;t really any labs or tuts.\nHence you can more or less learn the content without doing this course.</p>\n<h4 id=\"how-difficult-is-the-course\">How difficult is the course?</h4>\n<p>Comparing the course with COMP3[18]21, there&#39;s two big differences:</p>\n<ol>\n<li>The math tends to have more of a focus on statistics and linear algebra.</li>\n<li>The questions in the final exam aren&#39;t designed to trick you.</li>\n</ol>\n<p>The content isn&#39;t &quot;easy&quot;, i.e. we do go over some difficult proofs and content.\nThat being said, the way that the content is assessed is pretty chill.\nFor example, you won&#39;t be tested on coming up with some DP algorithm to solve a combinatorial problem.\nIt&#39;ll be moreso like what happens if I tweak an algorithm by doing X, or what is the probability of X happening for these inputs.</p>\n<h4 id=\"what-is-the-workload-like\">What is the workload like?</h4>\n<p>The course can be content heavy though the content is very interesting.\nThat being said, you&#39;re comfortable with math, many topics will be quite easy to grasp.\nSince, the course is 50% major project, 50% final exam, you could hypothetically do the major project whenever (as it doesn&#39;t have to rely on course content), and then only pay attention to the course at the very end.\nThat being said, you do learn quite a lot of techniques from the content, which can maybe help you with your major project.</p>\n<h2 id=\"comp9517---computer-vision\">COMP9517 - Computer Vision</h2>\n<p><em>Image processing, Feature Representation, Pattern Recognition, Image Segmentation, Motion Tracking, Deep Learning</em></p>\n<h3 id=\"overview-15\">Overview</h3>\n<p>A course that goes through different algorithms and techniques used in the field of Computer Vision.\nOverall the course is a bit more &quot;researchy&quot; compared to other CSE courses, and is more back heavy in workload once the group project begins.</p>\n<p>In terms of assessable content, there are labs, a solo assignment, a big group project, and a final exam.\nThe group project involves applying Computer Vision techniques, then making a video about techniques used, with a discussion on its results + improvements\nFor the exam, we were given a 10 page research paper, and required to do a 2 page literature review, (discuss the methods used, and discuss if they were suitable or not, along with issues or potential improvements).</p>\n<h4 id=\"should-i-know-machine-learning-beforehand\">Should I know machine learning beforehand?</h4>\n<p>It helps if you know Convolutional Neural Networks (CNNs), as this comes up in the later half of the course.\nMany modern computer vision problems use CNNs as they may provide better results than traditional methods, however, there isn&#39;t sufficient time in the course to properly &quot;teach&quot; you, and so it may require self study.\nCNNs can also be used in the assignment and may give better results, but the assignment is marked on how well you understood your techniques and how you evaluated their success and selected an appropriate method.\nThe knowledge also helps with literature review in the final exam, however, it&#39;s not guaranteed as the paper will involve techniques related to CNNs.</p>\n<h1 id=\"22t1\"><a href=\"#22t1\">22T1</a></h1>\n\n<h2 id=\"comp9315---database-management-system-implementation\">COMP9315 - Database Management System Implementation</h2>\n<p><em>Storage, Selection, Joins, Query Processing, Optimisation, ACID Transactions</em></p>\n<h3 id=\"overview-16\">Overview</h3>\n<p>This course goes over the low level implementation of a database (PostgreSQL in particular), and you code up some (not all) parts of a database management system.\nOverall, it&#39;s a fantastic course and will feel like OS (also goes through storage, and concurrency), but more algos focused.\nThere are two assignments, the first of which was related to implementing a new type in PGSQL (mix of C and SQL), and the second of which was to implement Multi-Attribute Linear Hashing in C.</p>\n<p>If you liked the algorithms part of OS, you&#39;ll likely also enjoy this course.\nBoth these courses also go through concurrency.</p>\n<h4 id=\"recommended-resources-9\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://use-the-index-luke.com/\">Use the index luke</a> (Interesting for learning about the impact of indexing on query performance)</li>\n</ul>\n<h2 id=\"comp9417---machine-learning-and-data-mining\">COMP9417 - Machine Learning and Data Mining</h2>\n<p><em>Regression, Classification, Tree Learning, Kernel Methods, Ensemble Learning, Neural Learning, Unsupervised Learning, Learning Theory</em></p>\n<h3 id=\"overview-17\">Overview</h3>\n<p>A course that goes through different algorithms / methods in machine learning.\nOverall, this course was a decent workload, with weekly problem sets (combination of math and coding), 2 homework sets (combination of math and coding in a report), and a group project.\nThe group project is done in groups of 4, and applying machine learning techniques to some problem, and writing a report on your techniques used.\nHowever, the grading is mostly done on your report (AKA how well written it is) rather than the performance of your model.</p>\n<h4 id=\"should-i-do-a-math-course-beforehand\">Should I do a math course beforehand?</h4>\n<p>It&#39;ll certainly help with the labs, overall, however may be fine without doing any other math course aside from the cores.\nBelow are a list of topics and the math that they involve, though you definitely won&#39;t need to understand the math super indepth.</p>\n<h4 id=\"recommended-resources-10\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=Gv9_4yMHFhI&list=PLblh5JKOoLUICTaGLRoHQDuF_7q2GfuJF\">StatQuest - Machine Learning</a> (Youtube playlist that goes over the math fundamentals and theory in ML)</li>\n</ul>\n<h1 id=\"22t2\"><a href=\"#22t2\">22T2</a></h1>\n\n<h2 id=\"arts1630---introductory-japanese-a\">ARTS1630 - Introductory Japanese A</h2>\n<p><em>hiragana, katakana, (basic kanji), conversational Japanese</em></p>\n<p>The content of this course follows along the Genki textbook up to chapter 6.</p>\n<p>Whilst most COMP courses you can learn online for free, in my opinion there&#39;s a lot of value in language courses as you get to interact with others who are also learning the language which isn&#39;t an experience you get solo learning.</p>\n<p>Having close to 0 knowledge of Japanese beforehand I felt the pacing was good, with tests on dictation (listening to Japanese and writing the Japanese, and reading Japanese), mock interactions, and a moodle exam (i.e. reading comprehension in Japanese + written essay on a topic), all of which helped a lot.</p>\n<h4 id=\"should-i-learn-japanese-or-another-language\">Should I learn Japanese or another language?</h4>\n<p>It&#39;s a good language to learn if you are already &quot;interested in Japanese culture&quot;, however if you want to quickly learn a language you can use, it&#39;s probably best to stick to a language closer to English (i.e. it is much easier to remember Germanic / Romance language vocabularies as they are similar to English).\nHowever, its differences makes it a very interesting language to learn for the sake of learning a language (i.e. you learn very &quot;formulaically&quot; the grammar structure which is different to English, which makes you &quot;think&quot; differently, and there&#39;s interesting stories to some of the kanji characters).</p>\n<h4 id=\"recommended-resources-11\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.tofugu.com/japanese/learn-hiragana/\">Tofugu - Learn Hiragana</a></li>\n<li><a href=\"https://www.tofugu.com/japanese/learn-katakana/\">Tofugu - Learn Katakana</a></li>\n</ul>\n<h2 id=\"comp6741---algorithms-for-intractable-problems\">COMP6741 - Algorithms for Intractable Problems</h2>\n<p><em>NP-completeness, Kernalisation, Paramterised Intractability, Branching Algorithms, Treewidth, Randomised Algorithms, Iterative Compression, Exponential time hypothesis, Heuristics and Local Search</em></p>\n<p>Hard course (for me) and intense both workload and content wise, runs every 2 years, cohort of 15 very smart people when I did it.</p>\n<p>The course focuses heavily on theoretical computer science and discrete / pure math topics - would definitely recommend having some courses or background experience in this field else, the workload can be even more intense than it already is.</p>\n<p>I would&#39;ve taken notes for this course but there was a lot of content, and a lot of logical reasoning that notes can&#39;t prepare you for.</p>\n<p>If you&#39;re genuinely considering taking this course, you should be smart enough to know the knowledge requirements so I&#39;m not going to mention recommended resources.</p>\n<h2 id=\"comp9444---neural-networks-and-deep-learning\">COMP9444 - Neural Networks and Deep Learning</h2>\n<p><em>Perceptrons, NN theory, CNNs, LSTMs, NLP, Deep Reinforcement Learning, Hopfield Network &amp; Boltzmann Machine, Autoencoders, Generative Adversarial Networks</em></p>\n<p>Most practical and fun AI course because you can take in inputs like images, video, natural language and do whatever whacky thing you want to do.\nNot super math heavy, as you mostly learn about different Neural Network architectures, and you use Pytorch to implement them.\nMajor group project where you make whatever using a NN and a final exam which was pretty easy.</p>\n<p>Note that as a higher level course, the course admining can be a bit dodgy at times, and it is usually up to you to self teach.\nIf you feel like you are comfortable enough self teaching the content, then there may be no need to take the course, as the course doesn&#39;t feature anything that you can&#39;t teach yourself online with, and there was very little to no feedback in the entire course.</p>\n<h4 id=\"recommended-resources-12\">Recommended resources</h4>\n<ul>\n<li><a href=\"https://www.deeplearningbook.org/\">Deep Learning Book (MIT)</a></li>\n</ul>\n<h1 id=\"22t3\"><a href=\"#22t3\">22T3</a></h1>\n\n<h2 id=\"comp3900---computer-science-project\">COMP3900 - Computer Science Project</h2>\n<p><em>Agile, Project Management Techniques, Ethics</em></p>\n<p>A necesary course for your degree.\nYou build web app (note it has to be a web app that can run on CSE machines) in a group of 5.\nThe project you build can either be based off a list of ideas they give you or you can propose a new idea.</p>\n<p>My recommendation would be to pick a project that everyone feels interested in working on, and set a level of complexity everyone is comfortable on in your proposal (i.e. do not say you will propose feature &#39;X&#39; for the sake of an impressive proposal), as you get marked more on completing everything in your proposal than you do on overall technical complexity.\nHence, you choose to some degree how much workload you want to put into this course.</p>\n<p>There are also lectures, but you only get assessed on your project proposal / project / project report, hence for the most part the lecture content can be ignored (it also tends to be quite wishy washy / already covered in previous courses, i.e. Git).</p>\n<h2 id=\"comp4920---professional-issues-and-ethics-in-information-technology\">COMP4920 - Professional Issues and Ethics in Information Technology</h2>\n<p><em>Utilitarianism, Dentological Ethics, Virtue Ethics, AI Ethics, Meta Ethics</em></p>\n<p>Quite a philosophical course that takes a high level look at ethics in Computer Science.\nAs a result the content feels too detached and is non reflective of typical ethical decisions that you make as a software engineer for it to be practical.\nHowever, the assessments - 50% essay assignment and 50% group work presentation does require you to fall back on essay writing skills and presentation skills which tbh was the main things I learnt from this course.</p>\n<h2 id=\"comp6991---solving-modern-programming-problems-with-rust\">COMP6991 - Solving Modern Programming Problems with Rust</h2>\n<p><em>Types, Error Handling, Borrowing, Lifetimes, Docs &amp; Testing, Polymorphism, Functions, Meta-Programming, Concurrency, Parallelism, Unsafes</em></p>\n<p>Quite a well run course (compared to other high level courses), that goes through different features of the Rust language (i.e. types, borrowing, lifetimes) and how they solve existing issues.\nThe course admining was quite good, resulting in helpful labs, workshops and forum responses, resulting in a good community when taking the course.</p>\n<p>It&#39;s not necessarily a Rust course, but the discussion of programming patterns are driven by the features of Rust.\nConsequently, you learn content i.e. memory management related to COMP1521, or design in COMP251, which is tailored to safe systems programming.</p>\n<h4 id=\"recommended-resources-13\">Recommended Resources</h4>\n<ul>\n<li><a href=\"https://doc.rust-lang.org/book/\">The Rust Programming Language</a></li>\n</ul>\n","metadata":{"title":"UNSW Course Review","description":"Review on courses I've taken at UNSW","date":"2023-04-20","mathjax":false,"hljs":false},"toc":[{"id":"preface","title":"Preface"},{"id":"20t1","title":"20T1"},{"id":"20t2","title":"20T2"},{"id":"20t3","title":"20T3"},{"id":"21t1","title":"21T1"},{"id":"21t2","title":"21T2"},{"id":"21t3","title":"21T3"},{"id":"22t1","title":"22T1"},{"id":"22t2","title":"22T2"},{"id":"22t3","title":"22T3"}]},"__N_SSG":true}